Module-4/rails-auth/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "foo"], ["password_digest", "$2a$10$HLGmf9FVfTo0Bu1BmED8..XMLvZxkRIxxvAZiEkNhdoj3YBeBsmRO"], ["created_at", "2017-08-08 21:00:30.615840"], ["updated_at", "2017-08-08 21:00:30.615840"]]
---
  def create
    # {name: 'bob', email: 'asklhsakj', password: 'sakljsalkj'}
    @user = User.create(user_params)

SELECT "users".* FROM "users"
---
  def index
    render json: {users: User.all}